Repository: mozilla-l10n/mt-training-data
Catalog: am/am_pontoon.tmx
Source language: en_us
Languages: am

source: Download { -brand-name-firefox-quantum }
am: { -brand-name-firefox-quantum }ን አውርድ

source: Download { -brand-name-lockwise }
am: አውርድ { -brand-name-lockwise }

source: Download { -brand-name-mozilla-vpn }
am: { -brand-name-mozilla-vpn }ን አውርድ

source: Download { -brand-name-mozilla-vpn } for { -brand-name-android }
am: { -brand-name-mozilla-vpn }ን ለ{ -brand-name-android } አውርድ

source: Download { -brand-name-mozilla-vpn } for { -brand-name-ios }
am: { -brand-name-mozilla-vpn }ን ለ { -brand-name-ios } አውርድ

source: Download { -brand-name-mozilla-vpn } for { -brand-name-linux }
am: { -brand-name-mozilla-vpn }ን ለ { -brand-name-linux } አውርድ

source: Download { -brand-name-mozilla-vpn } for { -brand-name-mac-short }
am: { -brand-name-mozilla-vpn }ን ለ { -brand-name-mac-short } አውርድ

source: Download { -brand-name-mozilla-vpn } for { -brand-name-windows }
am: { -brand-name-mozilla-vpn }ን ለ { -brand-name-windows } አውርድ

source: Download { -brand-name-mozilla-vpn } for { -brand-name-windows }, { -brand-name-mac }, { -brand-name-linux }, { -brand-name-android }, and { -brand-name-ios }.
am: { -brand-name-mozilla-vpn }ን ለ { -brand-name-windows }፣ { -brand-name-mac }፣ { -brand-name-linux }፣ { -brand-name-android } እና { -brand-name-ios } አውርድ።

source: Download for { -brand-name-android }
am: ለ{ -brand-name-android } አውርድ

source: Download for { -brand-name-ios }
am: ለ{ -brand-name-ios } አውርድ

source: Download previous versions for { -brand-name-windows } and { -brand-name-mac-short }
am: ለ{ -brand-name-windows } እና { -brand-name-mac-short } የቀድሞ ስሪቶችን አውርድ

source: Download { $product_label } for { $platform } in { $locale }
am: { $product_label } ለ { $platform } በ { $locale } ጫን

source: Download the { -brand-name-firefox-browser } in English (US) and more than 90 other languages
am: { -brand-name-firefox-browser }ን በእንግሊዝኛ (ዩኤስ) እና ከ 90 በላይ ሌሎች ቋንቋዎች አውርድ

source: Download VPN { -brand-name-mozilla-vpn } for { -brand-name-ios }
am: { -brand-name-mozilla-vpn }ን ለ{ -brand-name-ios } አውርድ

source: Email masking
am: የኢሜል ጭንብል

source: Empowering Women Online
am: በመስመር ላይ ሴቶችን ማበረታታት

source: Encrypt your network activity and hide your IP address
am: የአውታረ መረብ እንቅስቃሴዎን ያመስጥሩ እና የአውታር አድራሻዎን ይደብቁ

source: Every fingerprint is unique.
am: እያንዳንዱ የጣት አሻራ ልዩ ነው።

source: Everyone deserves access to the internet — your language should never be a barrier. That’s why — with the help of dedicated volunteers around the world — we make the { -brand-name-firefox-browser } available in more than 90 languages.
am: ሁሉም ሰው የኢንተርኔት አገልግሎት ማግኘት ይገባዋል - ቋንቋ መሰናክል ሊሆን አይገባውም። ለዛ ነው - በአለም ዙሪያ ባሉ በጎ ፈቃደኛ ሰዎች እርዳታ { -brand-name-firefox-browser }ን በ90 የተለያዩ ቋንቋዎች ያቀረብነው።

source: Experience augmented and virtual reality with { -brand-name-firefox }.
am: የተሻሻለ እና ምናባዊ እውነታን በ{ -brand-name-firefox } ይለማመዱ።

source: Explore the immersive web on your virtual reality headset.
am: በምናባዊ እውነታ የጆሮ ማዳመጫዎ ላይ አስማጭውን ድሩን ያስሱ።

source: Explore the web with the { -brand-name-firefox } browser for virtual reality.
am: ለምናባዊ እውነታ ድሩን በ{ -brand-name-firefox } አሳሽ ያስሱ።

source: Facebook Messenger
am: የፊስቡክ መለዕክተኛ

source: FAQs
am: (ተየጥ) ተደጋግሞ የሚጠየቁ ጥያቄዎች

source: Faster Performance
am: ፈጣን አፈጻጸም

source: Fast-forward to today, the competitive landscape for browsers has changed with many people beginning to question just what is happening to their online data such as browsing history, passwords, and other sensitive information. A lot has changed since 2008 when { -brand-name-chrome } came onto the scene. At { -brand-name-firefox }, we’ve been heads down, working to redesign our interface and provide users with an ever growing number of privacy and performance enhancements as well as plenty of handy browser tools.
am: ለዛሬ በፍጥነት ወደፊት፣ የአሳሾች የውድድር ገጽታ ተለውጧል ብዙ ሰዎች በመስመር ላይ ውሂባቸው ላይ እንደ የአሰሳ ታሪክ፣ የይለፍ ቃሎች እና ሌሎች ሚስጥራዊነት ያላቸው መረጃዎች ምን እየተፈጠረ እንዳለ መጠየቅ ሲጀምሩ ነው። ከ2008 ጀምሮ { -brand-name-chrome } ወደ ትእይንቱ ሲመጣ ብዙ ተለውጧል። በ{ -brand-name-firefox } ላይ፣ በይነገጻችንን እንደገና ለመንደፍ እና ለተጠቃሚዎች ከጊዜ ወደ ጊዜ እየጨመረ የሚሄዱ የግላዊነት እና የአፈጻጸም ማሻሻያዎችን እንዲሁም ብዙ ምቹ የአሳሽ መሳሪያዎችን ለማቅረብ ራሳችንን ዝቅ አድርገን እየሰራን ነው።

source: Fast-forward to today, the competitive landscape for browsers has changed, with many people beginning to question just what is happening to their online data such as browsing history, passwords, and other sensitive information. A lot has changed since 2008 when { -brand-name-chrome } came onto the scene. At { -brand-name-firefox }, we’ve been heads down, working to redesign our interface and provide users with an ever growing number of privacy and performance enhancements that are automatic by default as well as plenty of handy browser tools.
am: ለዛሬ በፍጥነት ወደፊት፣ የአሳሾች የውድድር ገጽታ ተለውጧል፣ ብዙ ሰዎች በመስመር ላይ ውሂባቸው ላይ እንደ የአሰሳ ታሪክ፣ የይለፍ ቃሎች እና ሌሎች ሚስጥራዊነት ያላቸው መረጃዎች ላይ ምን እየተፈጠረ እንዳለ መጠየቅ ጀምረዋል። ከ2008 ጀምሮ { -brand-name-chrome } ወደ ትእይንቱ ሲመጣ ብዙ ተለውጧል። በ{ -brand-name-firefox } ላይ፣ በይነገጻችንን እንደገና ለመንደፍ እና ለተጠቃሚዎች ከጊዜ ወደ ጊዜ እያደገ የሚሄዱ የግላዊነት እና የአፈጻጸም ማሻሻያዎችን በነባሪነት እና እንዲሁም ብዙ ምቹ የአሳሽ መሳሪያዎችን ለማቅረብ እየሄድን ነበር።

source: Featured in
am: ውስጥ ተለይቶ ቀርቧል

source: File a Bug
am: ሳንካ ያስመዝግቡ

source: Find an event
am: አንድ ክስተት ያግኙ

source: Find out about all the amazing <a href="{ $url }">{ -brand-name-firefox } features</a>.
am: ስለ ሁሉም አስደናቂ <a href="{ $url }">{ -brand-name-firefox } ባህሪያት</a> ይወቁ።

source: Find out how { -brand-name-firefox }, { -brand-name-chrome }, { -brand-name-edge }, { -brand-name-safari }, { -brand-name-opera } and { -brand-name-ie } differ in terms of privacy, utility and portability.
am: እንዴት { -brand-name-firefox }፣ { -brand-name-chrome }፣ { -brand-name-edge }፣ { -brand-name-safari }፣ { -brand-name-opera } እና { -brand-name-ie } በግላዊነት፣ መገልገያ እና ተንቀሳቃሽነት እንደሚለያዩ ይወቁ።

source: Find out how { -brand-name-firefox }, { -brand-name-chrome }, { -brand-name-edge }, { -brand-name-safari }, { -brand-name-opera }, { -brand-name-brave } and { -brand-name-ie } differ in terms of privacy, utility and portability.
am: እንዴት { -brand-name-firefox }፣ { -brand-name-chrome }፣ { -brand-name-edge }፣ { -brand-name-safari }፣ { -brand-name-opera }፣ { -brand-name-brave } እና { -brand-name-ie } በግላዊነት፣ መገልገያ እና ተንቀሳቃሽነት እንደሚለያዩ ይወቁ።

source: Firefox Better Web
am: ፋየርፎክስ የተሻለ ድር

source: Firefox Daylight
am: ፋየርፎክስ የቀን ብርሃን

source: Firefox Marketplace
am: የፋየርፎክስ ገበያ ቦታ

source: Firefox OS
am: ፋየርፎክስ OS

source: Firefox Private Network
am: የፋየርፎክስ የግል አውታረ መረብ

source: Firefox Quantum
am: ፋየርፎክስ Quantum

source: Follow @{ -brand-name-firefox }
am: @{ -brand-name-firefox }ን ይከተሉ

source: Follow { -brand-name-mozilla }
am: { -brand-name-mozilla }ን ተከተል

source: Follow @{ -brand-name-mozilla }
am: @{ -brand-name-mozilla }ን ይከተሉ

source: For more information about { -brand-name-mozilla }’s history, see the following:
am: ስለ { -brand-name-mozilla } ታሪክ የበለጠ መረጃ ለማግኘት የሚከተለውን ይመልከቱ፡-

source: For practical purposes, there’s obviously really nothing preventing you from using both browsers—{ -brand-name-firefox } for those moments in life when privacy really matters, and { -brand-name-chrome } if you’re still invested in the { -brand-name-google } ecosystem. Yet with the growing number of incursions into our personal data, { -brand-name-firefox } may prove to be the right choice in the long run for those of us who value protecting our personal privacy online.
am: ለተግባራዊ ዓላማዎች፣ ሁለቱንም አሳሾች ከመጠቀም የሚከለክል ምንም ነገር እንደሌለ ግልጽ ነው—{ -brand-name-firefox } በህይወት ውስጥ ግላዊነት በጣም አስፈላጊ ለሆኑ ጊዜያት እና { -brand-name-chrome } አሁንም ትኩረት ካደረጉ በ{ -brand-name-google } ስነ-ምህዳር። ነገር ግን ወደ ግል ውሂባችን የሚገቡ ወረራዎች ቁጥር እየጨመረ በመምጣቱ { -brand-name-firefox } በመስመር ላይ የግላችንን ግላዊነት ለመጠበቅ የምንጠቅመው በረጅም ጊዜ ትክክለኛ ምርጫ ሊሆን ይችላል።

source: Free Download
am: በነፃ ይጫኑ

source: From the maker of { -brand-name-firefox }, { -brand-name-mozilla-vpn } uses the advanced <a href="{ $url }" { $attrs }>{ -brand-name-wireguard }</a>® protocol to encrypt your online activity and hide your location.
am: ከ{ -brand-name-firefox } ፈጣሪ፣ { -brand-name-mozilla-vpn } የመስመር ላይ እንቅስቃሴዎን ለማመስጠር እና አካባቢዎን ለመደበቅ የላቀውን <a href="{ $url }" { $attrs }>{ -brand-name-wireguard }</a>® ፕሮቶኮል ይጠቀማል።

source: Gather in this interactive, online, multi-dimensional social space.
am: በዚህ በይነተገናኝ፣ በመስመር ላይ፣ ባለብዙ-ልኬት ማህበራዊ ቦታ ውስጥ ይሰብስቡ።

source: Get 12 month plan
am: የ 12 ወር እቅድ ያግኙ

source: Get 12-month plan
am: የ12 ወራት እቅድ ያግኙ

source: Get 6 month plan
am: የ6 ወር እቅድ ያግኙ

source: Get 6-month plan
am: የ6 ወር እቅድ ያግኙ

source: Get a { -brand-name-firefox-account }
am: የ { -brand-name-firefox-account } ያግኙ

source: Get a { -brand-name-firefox-account } – Keep your data private, safe and synced
am: { -brand-name-firefox-account } ያግኙ - ውሂብዎን የግል፣ ደህንነቱ የተጠበቀ እና የተስማማ አድርገው ይያዙ

source: Get a { -brand-name-mozilla-account } – Keep your data private, safe and synced
am: { -brand-name-mozilla-account } ያግኙ - ውሂብዎን የግል፣ ደህንነቱ የተጠበቀ እና የሰመረ ያድርጉ

source: Get all the speed and tools with none of the invasions of privacy. { -brand-name-firefox-browser } collects so little data about you, we don’t even require your email address to download. That’s because unlike other browsers, we have no financial stake in following you around the web.
am: ከማንኛውም የግላዊነት ወረራ ውጭ ሁሉንም ፍጥነት እና መሳሪያዎችን ያግኙ። { -brand-name-firefox-browser } ስለእርስዎ በጣም ትንሽ ውሂብ ይሰበስባል፣ ለማውረድ የኢሜይል አድራሻዎን እንኳን አንፈልግም። ይህ የሆነበት ምክንያት እንደሌሎች አሳሾች እርስዎን በድር ላይ በመከታተል ረገድ ምንም አይነት የገንዘብ ድርሻ የለንም።

source: Get answers to your questions about { -brand-name-firefox } and all { -brand-name-mozilla } products from our support team.
am: ስለ { -brand-name-firefox } እና ሁሉም { -brand-name-mozilla } ምርቶች ጥያቄዎችዎ መልስ ከድጋፍ ቡድናችን ያግኙ።

source: Get automatic privacy on your { -brand-name-iphone } and { -brand-name-ipad }
am: በእርስዎ { -brand-name-iphone } እና { -brand-name-ipad } ላይ ራስ-ሰር ግላዊነትን ያግኙ

source: Get { -brand-name-firefox }
am: { -brand-name-firefox }ን ያግኙ

source: Get { -brand-name-firefox } for { -brand-name-android } and { -brand-name-ios } now.
am: አሁኑኑ { -brand-name-firefox }ን ለ{ -brand-name-android } እና { -brand-name-ios } ያግኙ።

source: Get { -brand-name-mozilla-vpn }
am: { -brand-name-mozilla-vpn } ያግኙ

source: Get { -brand-name-pocket }
am: { -brand-name-pocket }ን ያግኙ

source: Get { -brand-name-vpn } + { -brand-name-relay }
am: ያግኙ { -brand-name-vpn } + { -brand-name-relay }

source: Get community and contribution news to your inbox
am: ለገቢ መልእክት ሳጥንዎ የማህበረሰብ እና የአስተዋጽኦ ዜና ያግኙ

source: Get email alerts when your info appears in a known data breach
am: መረጃዎ በሚታወቅ የውሂብ ጥሰት ውስጥ ሲታይ የኢሜይል ማንቂያዎችን ያግኙ

source: Get Help
am: እርዳታ ያግኙ

source: Get it free from the { -brand-name-app-store }
am: ከ{ -brand-name-app-store } በነፃ ያግኙት

source: Get it free on { -brand-name-google-play }
am: በ{ -brand-name-google-play } ላይ በነጻ ያግኙት

source: Get monthly plan
am: ወርሃዊ እቅድ ያግኙ

source: Get More From { -brand-name-firefox }
am: ከ{ -brand-name-firefox } ተጨማሪ ያግኙ

source: Get on { -brand-name-app-store }
am: በ{ -brand-name-app-store } ላይ ያግኙ

source: Get on { -brand-name-google-play } Store
am: በ{ -brand-name-google-play } መደብር ላይ ያግኙ

source: Get protection beyond your browser, on all your devices.
am: ከአሳሽዎ በተጨማሪ ጥበቃን በሁሉም መሳሪያዎችዎ ላይ ያግኙ።

source: Get speed and security. { -brand-name-firefox } is fast because we don’t track your moves.
am: ፍጥነት እና ደህንነት ያግኙ። { -brand-name-firefox } ፈጣን ነው ምክንያቱም እንቅስቃሴዎን አንከታተልም።

source: Get the app
am: መተግበሪያውን ያግኙ

source: Get the { -brand-name-facebook-container } Extension
am: { -brand-name-facebook-container } ቅጥያውን ያግኙ

source: Get the { -brand-name-firefox } browser built just for developers.
am: ለገንቢዎች ብቻ የተሰራውን የ{ -brand-name-firefox } አሳሽ ያግኙ።

source: Get the browsers that block 2000+ data trackers automatically. Enhanced Tracking Protection comes standard in every { -brand-name-firefox } browser.
am: 2000+ ውሂብ መከታተያዎችን በራስ ሰር የሚከለክሉትን አሳሾች ያግኙ። የተሻሻለ የክትትል ጥበቃ በእያንዳንዱ { -brand-name-firefox } አሳሽ ውስጥ መደበኛ ነው።

source: Get the browsers that put your privacy first — and always have
am: የእርስዎን ግላዊነት የሚያስቀድሙ አሳሾችን ያግኙ — ሁልጊዜም

source: Get the browser that gives more power to you on { -brand-name-windows }, { -brand-name-mac } or { -brand-name-linux }.
am: በ{ -brand-name-windows }፣ { -brand-name-mac } ወይም { -brand-name-linux } ላይ የበለጠ ኃይል የሚሰጥዎትን አሳሽ ያግኙ።

source: Get the browser that respects your privacy automatically. On { -brand-name-windows }, { -brand-name-mac } or { -brand-name-linux }.
am: የእርስዎን ግላዊነት የሚያከብር አሳሽ በራስ-ሰር ያግኙ። በ{ -brand-name-windows }፣ { -brand-name-mac } ወይም { -brand-name-linux } ላይ።

source: Get the customizable mobile browser for { -brand-name-android } smartphones.
am: ለ{ -brand-name-android } ብልህስልኮች ሊበጅ የሚችል የስልክ አሳሽ ያግኙ።

source: Get the details on the latest { -brand-name-firefox } updates.
am: የቅርብ ግዜውን { -brand-name-firefox } ዝማኔዎች ዝርዝሩ ያግኙ።

source: Get the mobile browser for your { -brand-name-iphone } or { -brand-name-ipad }.
am: ለእርስዎ { -brand-name-iphone } ወይም { -brand-name-ipad } የስልክ አሳሽ ያግኙ።

source: Get the mobile browser that puts your <strong>privacy</strong> first
am: የእርስዎን <strong>ግላዊነት</strong> የሚያስቀድመውን የተንቀሳቃሽ ስልክ አሳሽ ያግኙ

source: Get the not-for-profit-backed browser on { -brand-name-windows }, { -brand-name-mac-short } or { -brand-name-linux }.
am: ለትርፍ ባልተቋቋመ የሚደገፈውን አሳሽ በ{ -brand-name-windows }፣ { -brand-name-mac-short } ወይም { -brand-name-linux } ላይ ያግኙ።

source: Get the privacy you deserve. Enhanced Tracking Protection makes privacy automatic, every time you open your browser.
am: የሚገባዎትን ግላዊነት ያግኙ። የተሻሻለ የክትትል ጥበቃ አሳሽዎን በከፈቱ ቁጥር ግላዊነትን በራስ-ሰር ያደርገዋል።

source: Get together in virtual reality with this online social space.
am: በዚህ የመስመር ላይ ማህበራዊ ቦታ በምናባዊ እውነታ ውስጥ ተሰባሰቡ።

source: Get unmatched data protection on the release cadence that suits your organization.
am: ከድርጅትዎ ጋር በሚስማማው የልቀት መረጃ ላይ ተወዳዳሪ የሌለው የውሂብ ጥበቃ ያግኙ።

source: Glean
am: ግሌን

source: Go
am: ሂድ

source: Go mobile. Go indie with { -brand-name-firefox } for { -brand-name-android }
am: በሞባይል ይጠቀሙ። ለ{ -brand-name-android } { -brand-name-firefox }ን በመጠቀም በነፃነት ይጠቀሙ

source: Help fund our mission
am: ተልእኮአችንን በገንዘብ ይደግፉ

source: Help make { -brand-name-mozilla } products easy to use. Answer people’s “help” questions as part of the { -brand-name-mozilla } Support Community forums.
am: { -brand-name-mozilla } ምርቶችን ለመጠቀም ቀላል ለማድረግ ያግዙ። እንደ { -brand-name-mozilla } የማህበረሰብ ድጋፍ መድረኮች አካል የሰዎችን “እርዳታ” ጥያቄዎችን ይመልሱ።

source: Help make deep learning algorithms available to the open source world.
am: ጥልቅ የመማሪያ ስልተ ቀመሮችን ለክፍት ምንጭ አለም እንዲገኙ ያግዙ።

source: Help prevent { -brand-name-facebook } from collecting your data outside their site.
am: { -brand-name-facebook } ውሂብዎን ከድረ-ገፃቸው ውጭ እንዳይሰበስብ ለመከላከል ያግዙ።

source: Help us build a better { -brand-name-firefox } for all.
am: የተሻለ የ{ -brand-name-firefox } አገልግሎት ለሁሉም እንዲዳረስ ያግዙን።

source: Here we’ll compare our { -brand-name-firefox-browser } to the { -brand-name-chromium }-based { -brand-name-microsoft } { -brand-name-edge } in terms of privacy, utility, and portability, to help you have a better understanding of which browser better suits your needs and preferences.
am: እዚህ ጋ የትኛው አሳሽ ከእርስዎ ፍላጎቶች እና ምርጫዎች ጋር እንደሚስማማ የተሻለ ግንዛቤ እንዲኖርዎት ለማገዝ፤ የእኛን { -brand-name-firefox-browser } ከ { -brand-name-chromium } ላይ ከተመሰረተው { -brand-name-microsoft } { -brand-name-edge } ጋር በግላዊነት፣ መገልገያ እና ቀላልነት እናነፃፅራለን።

source: History of the { -brand-name-mozilla } Project
am: የ{ -brand-name-mozilla } ፕሮጀክት ታሪክ

source: How { -brand-name-firefox } compares to other browsers
am: { -brand-name-firefox } ከሌሎች አሳሾች ጋር እንዴት እንደሚወዳደር

source: How to block annoying ads using an ad blocker
am: የማስታወቂያ ማገጃን በመጠቀም የሚያናድዱ ማስታወቂያዎችን እንዴት ማገድ እንደሚቻል

source: How we compare to other browsers
am: ከሌሎች አሳሾች ጋር እንዴት እናወዳድር

source: How well does your browser work across your devices?
am: አሳሽዎ በሁሉም መሳሪያዎችዎ ላይ ምን ያህል በጥሩ ሁኔታ ይሰራል?

source: How you can contribute…
am: እንዴት ማበርከት እንደሚችሉ…

source: Hulu
am: ሁሉ

source: If having tons of open tabs is your thing, then it really comes down to your UI preference. { -brand-name-firefox } features a horizontal scroll on all your open tabs rather than shrinking them smaller and smaller with each new one. { -brand-name-google } { -brand-name-chrome } prefers to shrink them down so just the favicon is visible. The only problem with this is when you have multiple tabs open from the same website, so you see the same favicon across your tabs.
am: ብዙ ክፍት ትሮች መኖሩ የእርስዎ ነገር ከሆነ፣ በእርግጥ ወደ የእርስዎ UI ምርጫ ይወርዳል። { -brand-name-firefox } በሁሉም ክፍት ትሮችዎ ላይ በእያንዳንዱ አዲስ ትንሽ እና ትንሽ ከመቀነስ ይልቅ አግድም ጥቅልል ያቀርባል። { -brand-name-google } { -brand-name-chrome } ተወዳጅ አዶ ብቻ እንዲታይ እነሱን መቀነስ ይመርጣል። የዚህ ብቸኛው ችግር ከተመሳሳይ ድህረ ገጽ ብዙ ትሮች ሲከፈቱ ነው፣ ስለዚህ በትሮችዎ ላይ አንድ አይነት ተወዳጅ አዶ ያያሉ።

source: If you choose to use { -brand-name-safari }, you’re in safe hands as long as you’re using an { -brand-name-apple } device. But { -brand-name-safari } only works on { -brand-name-apple } devices, whereas { -brand-name-firefox } works on { -brand-name-windows }, { -brand-name-mac }, { -brand-name-ios }, { -brand-name-android } and { -brand-name-linux }. So no matter what operating system you choose, { -brand-name-firefox } has you covered with our security and privacy protections.
am: { -brand-name-safari }ን ለመጠቀም ከመረጡ፣ የ{ -brand-name-apple } መሣሪያን እስከተጠቀሙ ድረስ ደህንነቱ በተጠበቀ እጅ ውስጥ ነዎት። ግን { -brand-name-safari } በ{ -brand-name-apple } መሳሪያዎች ላይ ብቻ ይሰራል፣ { -brand-name-firefox } ግን በ{ -brand-name-windows }፣ { -brand-name-mac }{ -brand-name-ios }፣{ -brand-name-android } እና { -brand-name-linux }ላይ ይሰራል። ስለዚህ ምንም አይነት ስርዓተ ክወና ቢመርጡ { -brand-name-firefox } በእኛ የደህንነት እና የግላዊነት ጥበቃዎች ሸፍኖዎታል።

source: If your experience of a website differs between browsers then you may have discovered a web compatibility issue. We would love to know about it!
am: የእርስዎ የድር ጣቢያ ልምድ በአሳሾች መካከል የሚለያይ ከሆነ የድር ተኳኋኝነት ችግርን አግኝተው ሊሆን ይችላል። ስለእሱ ማወቅ እንፈልጋለን!

source: If you use a { -brand-name-mac-short } or have an { -brand-name-iphone }, chances are you’re familiar with the { -brand-name-safari } web browser. The fact that it’s pre-installed as the default browser for { -brand-name-apple } product users definitely gives it an early advantage, but { -brand-name-firefox } has its own set of useful features that make it an attractive alternative and can now be set as your default browser on your { -brand-name-mac-short } and { -brand-name-iphone }. Here we’ll explore the main differences between our browser and { -brand-name-safari } in terms of privacy, utility and portability between devices.
am: { -brand-name-mac-short }ን ከተጠቀሙ ወይም { -brand-name-iphone } ካለዎት የ{ -brand-name-safari } ድር አሳሽን የማወቁ እድል አለዎት። ለ{ -brand-name-apple } ምርት ተጠቃሚዎች እንደ ነባሪ አሳሽ አስቀድሞ መጫኑ በእርግጥ ቀደምት ጥቅም ይሰጠዋል፣ ነገር ግን { -brand-name-firefox } የራሱ የሆኑ ጠቃሚ ባህሪያት ስላሉት ማራኪ አማራጭ ያደርገዋል እናም አሁን እንደ ነባሪ አሳሽዎ በእርስዎ { -brand-name-mac-short } እና { -brand-name-iphone } ላይ ሊዋቀር ይችላል። እዚህ በአሳሽችን እና በ{ -brand-name-safari } መካከል በግላዊነት፣ በአገልግሎት እና በመሳሪያዎች መካከል ያለውን ተንቀሳቃሽነት በተመለከተ ዋና ዋና ልዩነቶችን እንመረምራለን።

source: If you use a Mac or have an { -brand-name-iphone }, chances are you’re familiar with the { -brand-name-safari } web browser. The fact that it’s pre-installed as the default browser for { -brand-name-apple } product users definitely gives it an early advantage, but { -brand-name-firefox } has its own set of useful features that make it an attractive alternative. Here we’ll explore the main differences between our browser and { -brand-name-safari } in terms of privacy, utility, and portability between devices.
am: ማክን ከተጠቀሙ ወይም { -brand-name-iphone } ካለዎት የ{ -brand-name-safari } ድር አሳሹን በደንብ ያውቃሉ። ለ{ -brand-name-apple } ምርት ተጠቃሚዎች እንደ ነባሪ አሳሽ አስቀድሞ መጫኑ በእርግጥ ቀደምት ጥቅም ይሰጠዋል፣ ነገር ግን { -brand-name-firefox } የራሱ የሆኑ ጠቃሚ ባህሪያት ስላሉት ማራኪ አማራጭ ያደርገዋል። እዚህ በአሳሻችን እና በ{ -brand-name-safari } መካከል በግላዊነት፣ መገልገያ እና በመሳሪያዎች መካከል ያለውን ተንቀሳቃሽነት በተመለከተ ዋና ዋና ልዩነቶችን እንመረምራለን።

source: If you want to join us in our mission, please <a href="{ $contribute }">get involved</a>.
am: በተልዕኳችን ውስጥ ከእኛ ጋር መቀላቀል ከፈለጉ፣ እባክዎ <a href="{ $contribute }">ይሳተፉ</a>።

source: In 2003, the { -brand-name-mozilla } project created the { -brand-name-mozilla-foundation }, an <a href="{ $foundation }">independent non-profit organization</a> supported by individual donors and a variety of companies.
am: እ.ኤ.አ. በ2003፣ የ{ -brand-name-mozilla } ፕሮጀክት የ{ -brand-name-mozilla-foundation }ን <a href="{ $foundation }">ገለልተኛ ለትርፍ ያልተቋቋመ ድርጅት</a>ን በግል ለጋሾች እና የተለያዩ ኩባንያዎች የሚደገፍ ፈጠረ።

source: In 2008, { -brand-name-google } introduced { -brand-name-chrome }, and its impact as an innovation in browser technology was immediate. It was faster for loading sites, took up minimal screen space and offered an undeniably simple user interface.
am: እ.ኤ.አ. በ2008፣ { -brand-name-google } { -brand-name-chrome }ን አስተዋወቀ፣ እና በአሳሽ ቴክኖሎጂ ውስጥ እንደ ፈጠራ ያለው ተፅእኖ ወዲያውኑ ነበር። ድረ-ገፆችን ለመጫን ፈጣን ነበር፣ አነስተኛውን የስክሪን ቦታ የወሰደ እና የማይካድ ቀላል የተጠቃሚ በይነገጽ አቅርቧል።

source: In 2013, we launched <a href="{ $firefoxos }">{ -brand-name-firefox-os }</a> to unleash the full power of the web on smartphones and once again offer control and choice to a new generation of people coming online.
am: እ.ኤ.አ. በ2013 የድሩን ሙሉ ሃይል በስማርት ስልኮች ላይ ለማስለቀቅ <a href="{ $firefoxos }">{ -brand-name-firefox-os }</a>ን አስጀምረናል እና እንደገና ቁጥጥር እና ምርጫን ለአዲስ ለማቅረብ በመስመር ላይ የሚመጡ የሰዎች ትውልድ።

source: In addition to privacy protection, which largely takes place in the background of the browser, another key ingredient to a well-made browser is the actual user interface and functionality. Almost all seven browsers are equal when it comes to tab browsing, bookmark management, auto-completion, proofreading and extensions. { -brand-name-firefox }, { -brand-name-edge } and { -brand-name-opera } also offer a quick screenshot function that proves to be quite handy and is definitely something you notice is missing when you switch over to a browser without it.
am: በአብዛኛው በአሳሹ ዳራ ውስጥ ከሚካሄደው የግላዊነት ጥበቃ በተጨማሪ በደንብ ለተሰራ አሳሽ ሌላው ቁልፍ ቅመም የተጠቃሚው በይነገጽ እና ተግባራዊነት ነው። ከሞላ ጎደል ትር አሰሳ፣ የእልባት አስተዳደር፣ ራስ-አጠናቅቅ፣ እርማት እና ቅጥያዎችን በተመለከተ ሰባቱም አሳሾች በሙሉ እኩል ናቸው። { -brand-name-firefox }፣ { -brand-name-edge } እና { -brand-name-opera } በተጨማሪም በጣም ምቹነትን የሚያረጋግጥ ፈጣን የቅጽበታዊ ገጽ እይታ ተግባርን ይሰጣሉ እናም ያንን በሌለው አሳሽ ሲጠቀሙ በርግጠኝነት የሆነ የሚያውቁት ነገር ጠፍቷል።

source: In addition to privacy protection, which largely takes place in the background of the browser, another key ingredient to a well-made browser is the actual user interface and functionality. Almost all six browsers are equal when it comes to tab browsing, bookmark management, auto-completion, proofreading and extensions. { -brand-name-firefox }, { -brand-name-edge } and { -brand-name-opera } also offer a quick screenshot function that proves to be quite handy and is definitely something you notice is missing when you switch over to a browser without it.
am: በአብዛኛው በአሳሹ ዳራ ውስጥ ከሚካሄደው የግላዊነት ጥበቃ በተጨማሪ በደንብ ለተሰራ አሳሽ ሌላው ቁልፍ ቅመም የተጠቃሚው በይነገጽ እና ተግባራዊነት ነው። ከሞላ ጎደል ትር አሰሳ፣ የእልባት አስተዳደር፣ ራስ-አጠናቅቅ፣ እርማት እና ቅጥያዎችን በተመለከተ ስድስቱም አሳሾች በሙሉ እኩል ናቸው። { -brand-name-firefox }፣ { -brand-name-edge } እና { -brand-name-opera } በተጨማሪም በጣም ምቹነትን የሚያረጋግጥ ፈጣን የቅጽበታዊ ገጽ እይታ ተግባርን ይሰጣሉ እናም ያንን በሌለው አሳሽ ሲጠቀሙ በርግጠኝነት የሆነ የሚያውቁት ነገር ጠፍቷል።

source: In addition to the regular mobile app, { -brand-name-opera } has two other mobile versions of its browser: Touch and Mini. Touch is light on features but it’s designed to use on the go with only one hand. The Mini version aims at lowering data usage and increased speeds on slow connections by downgrading images and stripping away content.
am: ከመደበኛው የሞባይል መተግበሪያ በተጨማሪ፣ { -brand-name-opera } ሁለት ሌሎች የሞባይል ስሪቶች አሉት፥ ንካ እና ሚኒ። ንካ በባህሪያት ላይ ቀላል ነው ነገር ግን በአንድ እጅ ብቻ በጉዞ ላይ እንዲውል የተቀየሰ ነው። ሚኒ ስሪቱ ምስሎችን በማውረድ እና ይዘትን በማራገፍ የውሂብ አጠቃቀምን እና በዝግታ ግንኙነቶች ላይ ፍጥነትን ለመጨመር ያለመ ነው።
